---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures
source: html/6c30543b-4a09-53d0-0867-a2c2c49a4e57.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures

Failures about GeometryFailures.

## Syntax (C#)
```csharp
public static class GeometryFailures
```